In [2]:
import pandas as pd

In [3]:
cars=pd.read_csv("C:\\Users\\pgkvi\\OneDrive\\Desktop\\Python Practice\\DS course\\DataSet\\usedcars.csv")
cars.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO
2  2011   SEL  19995     7351  Silver         AUTO
3  2011   SEL  17809    11613    Gray         AUTO
4  2012    SE  17500     8367   White         AUTO

In [4]:
cars.model.value_counts()

SE     78
SES    48
SEL    24
Name: model, dtype: int64

In [7]:
cars.color.value_counts(sort=False)#no order

Yellow     3
Gray      16
Silver    32
White     16
Blue      17
Black     35
Green      5
Red       25
Gold       1
Name: color, dtype: int64

In [6]:
cars.transmission.value_counts(ascending=True)

MANUAL     22
AUTO      128
Name: transmission, dtype: int64

In [8]:
cars.model.value_counts(normalize=True) #get the proportion %

SE     0.52
SES    0.32
SEL    0.16
Name: model, dtype: float64

In [12]:
snsdata=pd.read_csv("C:\\Users\\pgkvi\\OneDrive\\Desktop\\Python Practice\\DS course\\DataSet\\snsdata.csv")
snsdata.head(10),snsdata.shape

(   gradyear gender     age  friends  basketball  football  soccer  softball  \
 0      2006      M     NaN        7           0         0       0         0
 1      2006      F  18.801        0           0         1       0         0
 2      2006      M  18.335       69           0         1       0         0
 3      2006      F  18.875        0           0         0       0         0
 4      2006    NaN  18.995       10           0         0       0         0
 5      2006      F     NaN      142           0         0       0         0
 6      2006      F  18.930       72           0         0       0         0
 7      2006      M  18.322       17           0         0       0         1
 8      2006      F  19.055       52           0         0       0         0
 9      2006      F  18.708       39           0         0       0         0

    volleyball  swimming  ...  blonde  mall  shopping  clothes  hollister  \
 0           0         0  ...       0     0         0        0          0
 1           0         0  ...       0     1         0        0          0
 2           0         0  ...       0     0         0        0          0
 3           0         0  ...       0     0         0        0          0
 4           0         0  ...       0     0         2        0          0
 5           0         0  ...       0     0         1        0          0
 6           0         0  ...       0     2         0        0          2
 7           0         0  ...       0     0         0        0          0
 8           0         0  ...       0     0         0        0          0
 9           0         0  ...       0     0         1        0          0

    abercrombie  die  death  drunk  drugs
 0            0    0      0      0      0
 1            0    0      0      0      0
 2            0    0      1      0      0
 3            0    0      0      0      0
 4            0    0      0      1      1
 5            0    0      0      1      0
 6            0    0      0      0      0
 7            0    0      0      0      0
 8            0    0      0      0      0
 9            0    0      0      0      0

 [10 rows x 40 columns],
 (30000, 40))

In [14]:
snsdata.isna().sum().to_frame()

                 0
gradyear         0
gender        2724
age           5087
friends          0
basketball       0
football         0
soccer           0
softball         0
volleyball       0
swimming         0
cheerleading     0
baseball         0
tennis           0
sports           0
cute             0
sex              0
sexy             0
hot              0
kissed           0
dance            0
band             0
marching         0
music            0
rock             0
god              0
church           0
jesus            0
bible            0
hair             0
dress            0
blonde           0
mall             0
shopping         0
clothes          0
hollister        0
abercrombie      0
die              0
death            0
drunk            0
drugs            0

In [17]:
snsdata.gender.value_counts(dropna=False,normalize=True)

F      0.735133
M      0.174067
NaN    0.090800
Name: gender, dtype: float64

In [18]:
insurance=pd.read_csv("C:\\Users\\pgkvi\\OneDrive\\Desktop\\Python Practice\\DS course\\DataSet\\insurance.csv")
insurance.head()

   age  gender     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [19]:
insurance.region.value_counts()

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

In [20]:
insurance.isna().sum()

age         0
gender      0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [21]:
insurance.smoker.value_counts()

no     1064
yes     274
Name: smoker, dtype: int64

In [22]:
insurance.smoker.value_counts(normalize=True)

no     0.795217
yes    0.204783
Name: smoker, dtype: float64

In [23]:
cars=pd.read_csv("C:\\Users\\pgkvi\\OneDrive\\Desktop\\Python Practice\\DS course\\DataSet\\usedcars.csv")
cars.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO
2  2011   SEL  19995     7351  Silver         AUTO
3  2011   SEL  17809    11613    Gray         AUTO
4  2012    SE  17500     8367   White         AUTO

In [24]:
cars.price.min(),cars.price.max(),cars.price.mean()

(3800, 21992, 12961.933333333332)

In [25]:
import numpy as np

In [26]:
np.min(cars.price),np.max(cars.price),np.mean(cars.price)

(3800, 21992, 12961.933333333332)

In [28]:
cars.price.median(),np.median(cars.price)

(13591.5, 13591.5)